articles = [
    {
        "source": {
            "id": "rbc",
            "name": "RBC"
        },
        "author": "RBC",
        "title": "Apple надеется на iPhone и Индию: что компания cообщила в отчете :: РБК Pro",
        "description": "Компания Apple во втором квартале зафиксировала рекорд в продажах iPhone — $51,3 млрд — и исторический рекорд в сервисном направлении — $20,9 млрд. Самыми перспективными рынками для компании становятся Индия, Латинская Америка и Центральная Азия - РБК Pro",
        "url": "https://pro.rbc.ru/demo/645513b89a7947a25f3527c2?from=from_main_5&amp;utm_source=rbc.ru&amp;utm_medium=inhouse_media&amp;utm_campaign=lines_5&amp;utm_content=645513b89a7947a25f3527c2&amp;utm_term=10.4Z_noauth",
        "urlToImage": "https://s0.rbk.ru/v6_top_pics/media/img/0/16/346834419751160.jpg",
        "publishedAt": "2023-05-08T12:07:24.8052573Z",
        "content": "Apple 4 2023 ( 1 ). $94,8 (–3% ),  — $1,52. , ($92,6 ).\r\n« , $28,6 , $23 », — Apple . $90  — $0,24 (+4%).\r\n 5 5%."
    },
    {
        "source": {
            "id": "rbc",
            "name": "RBC"
        },
        "author": "RBC",
        "title": "Боррель заявил о разрыве между Западом и развивающимися странами",
        "description": "Боррель считает, что боевые действия между Россией и Украиной объединил трансатлантический альянс; при этом в отношениях с развивающимися странами растет раскол, который выходит за рамки военного конфликта",
        "url": "https://www.rbc.ru/politics/08/05/2023/6458d78d9a7947bd86e3ebff?from=from_main_6",
        "urlToImage": "https://s0.rbk.ru/v6_top_pics/media/img/0/75/346835471148750.jpg",
        "publishedAt": "2023-05-08T11:58:33Z",
        "content": ";   G7 « » , .\r\n , , , : « , ».\r\n ; ,   « ,  — »; - - , , .\r\n , . «,  — , , — - » — .\r\n . « , &lt;...&gt; , , , », — .\r\n . 2022 , , « ». « ». « », ."
    },
    {
        "source": {
            "id": "rbc",
            "name": "RBC"
        },
        "author": "RBC",
        "title": "СБУ предъявила Машкову подозрения по трем статьям",
        "description": "СБУ сообщила актеру Машкову о подозрении из-за посещения Крыма и Донбасса, а также по статьям об оправдании российской «вооруженной агрессии» и посягательстве на территориальную целостность Украины",
        "url": "https://www.rbc.ru/politics/08/05/2023/6458d84e9a7947f80f8290ae?from=from_main_4",
        "urlToImage": "https://s0.rbk.ru/v6_top_pics/media/img/1/01/346835452406011.jpg",
        "publishedAt": "2023-05-08T11:27:19Z",
        "content": "() , .\r\n« . &lt;...&gt; », — -.\r\n : . 2 . 110 ( ); . 1 . 3 . 436-2 ( « » ); . 1 . 2 . 332-1 ( ).\r\n ."
    },
    {
        "source": {
            "id": "rbc",
            "name": "RBC"
        },
        "author": "RBC",
        "title": "Путин пообещал помощь пострадавшим от природных пожаров",
        "description": "Глава МЧС накануне прилетел в Курганскую область, где действует режим ЧС. Вместе с губернатором региона они рассказали Путину о ситуации с пожарами в регионе, тот пообещал, что пострадавшим окажут помощь",
        "url": "https://www.rbc.ru/society/08/05/2023/6458cae99a7947dbd26c9343?from=from_main_3",
        "urlToImage": "https://s0.rbk.ru/v6_top_pics/media/img/3/86/346835426351863.jpg",
        "publishedAt": "2023-05-08T10:43:53Z",
        "content": ", , .\r\n« , », — . , 19 . « - , », — .\r\n - , 8 , . «  — », — .\r\n  , 7 ; , , . , . . - , . , .\r\n , .  . (. 2 . 293 ). , 8 ."
    },
    {
        "source": {
            "id": "rbc",
            "name": "RBC"
        },
        "author": "RBC",
        "title": "Четвертый иностранный лидер решил приехать на парад в Москву",
        "description": "Премьер-министр Армении, президенты Казахстана и Таджикистана приедут в Москву на 9 Мая. Ранее участие в праздновании подтвердил президент Киргизии",
        "url": "https://www.rbc.ru/politics/08/05/2023/6458cac39a7947dbd26c9341?from=from_main_9",
        "urlToImage": "https://s0.rbk.ru/v6_top_pics/media/img/5/87/346835455992875.jpg",
        "publishedAt": "2023-05-08T10:42:07Z",
        "content": ""
    },
    {
        "source": {
            "id": "rbc",
            "name": "RBC"
        },
        "author": "RBC",
        "title": "В Кремле назвали чудовищными слова главы ГУР об «убийстве русских»",
        "description": "Дмитрий Песков заявил, что Москва ждет реакции стран Европы и США на обещание главы ГУР «убивать русских до полной победы Украины». Российские спецслужбы сделают все необходимое «на фоне таких заявлений», сказали в Кремле",
        "url": "https://www.rbc.ru/politics/08/05/2023/6458b9e09a79472062728ce5?from=from_main_7",
        "urlToImage": "https://s0.rbk.ru/v6_top_pics/media/img/0/57/346835387493570.jpg",
        "publishedAt": "2023-05-08T09:06:40Z",
        "content": ""
    },
    {
        "source": {
            "id": "rbc",
            "name": "RBC"
        },
        "author": "RBC",
        "title": "Китай предупредил о подрыве доверия к ЕС в случае санкций против Пекина",
        "description": "Представитель МИД Китая пообещал, что страна примет ответные меры в случае санкций против компаний, которых Брюссель подозревает в оказании помощи России. Пекин не раз говорил, что не будет намеренно обходить ограничения",
        "url": "https://www.rbc.ru/politics/08/05/2023/6458ac4f9a7947b4030366bc?from=from_main_10",
        "urlToImage": "https://s0.rbk.ru/v6_top_pics/media/img/3/50/346835350379503.jpg",
        "publishedAt": "2023-05-08T08:35:03Z",
        "content": ", , .\r\n « », , « » ( ).\r\n Financial Times , , , , . , , : HC Semiconductors, King-Pai Technology, Sinno Electronics, Sigma Technology, Asia Pacific Links, Tordan Industry Alpha Trading Investments.\r\n… [+85 chars]"
    },
    {
        "source": {
            "id": "rbc",
            "name": "RBC"
        },
        "author": "RBC",
        "title": "Кличко заявил о «самой массированной атаке» на Киев",
        "description": "Кличко заявил, что ночью Киев подвергся самой массированной с начала спецоперации атаке. По его словам, погибших нет, пять человек пострадали",
        "url": "https://www.rbc.ru/politics/08/05/2023/6458b0729a794709d42c221c?from=from_main_2",
        "urlToImage": "https://s0.rbk.ru/v6_top_pics/media/img/2/98/346835342912982.jpg",
        "publishedAt": "2023-05-08T08:24:50Z",
        "content": ""
    },
    {
        "source": {
            "id": "rbc",
            "name": "RBC"
        },
        "author": "RBC",
        "title": "ФСБ задержала пытавшихся устроить диверсию в Челябинской области",
        "description": "В Магнитогорске задержали трех человек, причастных к выводу из строя оборудования железной дороги, сообщила ФСБ. По версии следствия, они пытались совершить диверсию за вознаграждение",
        "url": "https://www.rbc.ru/society/08/05/2023/6458a4c99a7947169402ee00?from=from_main_11",
        "urlToImage": "https://s0.rbk.ru/v6_top_pics/media/img/6/51/346835332074516.jpg",
        "publishedAt": "2023-05-08T07:37:21Z",
        "content": ", , - .\r\n - - , 7  — .\r\n«» , , « - ». - , .\r\n« », . 281 ().\r\n4 ,  — .\r\n -1 — . 1,5 , , . .\r\n .\r\n (. «» . 2 . 281 ) - . , ."
    },
    {
        "source": {
            "id": "rbc",
            "name": "RBC"
        },
        "author": "RBC",
        "title": "Зеленский заменил День Победы на День Европы",
        "description": "Праздник мира и единства будет правильно отмечать 9 мая, «вместе со всей свободной Европой», заявил Владимир Зеленский. 8 мая он предлагает установить в стране День памяти и победы над нацизмом во Второй мировой войне",
        "url": "https://www.rbc.ru/politics/08/05/2023/645896f09a79474300ee2336?from=from_main_8",
        "urlToImage": "https://s0.rbk.ru/v6_top_pics/media/img/7/18/346835438564187.jpg",
        "publishedAt": "2023-05-08T07:24:23Z",
        "content": "9 , .\r\n Telegram , « ».\r\n 9 . 9 1950 , . .\r\n , , 2003 . .\r\n, , 8   . « 8 . 8 , . 8 », — .\r\n 2015 8 , 9  — . 1941–1945 .\r\n , 9 , , « ».\r\n , , 9 . «» «» , 8 ,   « , ». ; 9 ."
    }
]